{
  "CopilotChat.nvim": { "branch": "canary" },
  "FixCursorHold.nvim": { "branch": "master" },
  "HighStr.nvim": { "branch": "main" },
  "LuaSnip": { "branch": "master" },
  "barbecue": { "branch": "main" },
  "cellular-automaton.nvim": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "coerce.nvim": { "branch": "main" },
  "colorful-winsep.nvim": { "branch": "alpha" },
  "conform.nvim": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "dashboard-nvim": { "branch": "master" },
  "dial.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "duckytype.nvim": { "branch": "main" },
  "easypick.nvim": { "branch": "main" },
  "edgy.nvim": { "branch": "main" },
  "git-blame.nvim": { "branch": "master" },
  "git-conflict.nvim": { "branch": "main" },
  "git-worktree.nvim": { "branch": "main" },
  "gitlinker.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "global-note.nvim": { "branch": "main" },
  "goto-breakpoints.nvim": { "branch": "master" },
  "grapple.nvim": { "branch": "main" },
  "hawtkeys.nvim": { "branch": "main" },
  "hop.nvim": { "branch": "master" },
  "inc-rename.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "lazygit.nvim": { "branch": "main" },
  "leetcode.nvim": { "branch": "master" },
  "lsp-zero.nvim": { "branch": "v3.x" },
  "lualine.nvim": { "branch": "master" },
  "luvit-meta": { "branch": "main" },
  "markdown-preview.nvim": { "branch": "master" },
  "marp-nvim": { "branch": "main" },
  "mason-conform.nvim": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "mini.align": { "branch": "main" },
  "neo-tree.nvim": { "branch": "v3.x" },
  "neodev.nvim": { "branch": "main" },
  "neoscopes": { "branch": "main" },
  "neotest": { "branch": "master" },
  "neotest-gtest": { "branch": "main" },
  "neotest-python": { "branch": "master" },
  "nerdy.nvim": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nredir.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-biscuits": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-config-local": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-expand-expr": { "branch": "main" },
  "nvim-ghost.nvim": { "branch": "main" },
  "nvim-hlslens": { "branch": "main" },
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-navic": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-recorder": { "branch": "main" },
  "nvim-scrollbar": { "branch": "main" },
  "nvim-spectre": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-tmux-navigation": { "branch": "main" },
  "nvim-toggleterm.lua": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-ufo": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "obsidian.nvim": { "branch": "main" },
  "oil.nvim": { "branch": "master" },
  "other.nvim": { "branch": "main" },
  "overseer.nvim": { "branch": "master" },
  "persistent-breakpoints.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "project.nvim": { "branch": "main" },
  "promise-async": { "branch": "main" },
  "rainbow-delimiters.nvim": { "branch": "master" },
  "resession.nvim": { "branch": "master" },
  "telescope-dap.nvim": { "branch": "master" },
  "telescope-diff.nvim": { "branch": "master" },
  "telescope-emoji.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-git-conflicts.nvim": { "branch": "main" },
  "telescope-git-diffs.nvim": { "branch": "main" },
  "telescope-live-grep-args.nvim": { "branch": "master" },
  "telescope-picker-list.nvim": { "branch": "master" },
  "telescope-resession.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "toggleterm-manager.nvim": { "branch": "main" },
  "trailblazer.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "undotree": { "branch": "master" },
  "vim-bbye": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-log-highlighting": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-symlink": { "branch": "master" },
  "vista.vim": { "branch": "master" },
  "vscode.nvim": { "branch": "main" },
  "which-key.nvim": { "branch": "main" },
  "zen-mode.nvim": { "branch": "main" }
}
